In [3]:
import pandas as pd

csv_path = "Salaries.csv"

df = pd.read_csv(csv_path)

df.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [9]:
songs = {"Album": ["Thriller", "Back in Black", "The Dark Side of the Moon", "The Bodyguard", "Bat Out of Hell"], 
         "Released" : [1982, 1980, 1973, 1992, 1977], 
        "length": ["00:42:19", "00:42:11", "00:42:49", "00:57:44", "00:46:33"]}
songs_frame = pd.DataFrame(songs)
songs_frame.head()

                       Album  Released    length
0                   Thriller      1982  00:42:19
1              Back in Black      1980  00:42:11
2  The Dark Side of the Moon      1973  00:42:49
3              The Bodyguard      1992  00:57:44
4            Bat Out of Hell      1977  00:46:33

In [11]:
x = songs_frame[["Album", "length"]]
x.head()

                       Album    length
0                   Thriller  00:42:19
1              Back in Black  00:42:11
2  The Dark Side of the Moon  00:42:49
3              The Bodyguard  00:57:44
4            Bat Out of Hell  00:46:33

In [7]:
excel_path = "C:\\Users\\gjriv\\Desktop\\Financial_Sample.xlsx"

df1 = pd.read_excel(excel_path)
df1.head()

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,None,1618.5,3,20,32370.0,0.0,32370.0,16185.0,16185.0,2014-01-01,1,January,2014
1,Government,Germany,Carretera,None,1321.0,3,20,26420.0,0.0,26420.0,13210.0,13210.0,2014-01-01,1,January,2014
2,Midmarket,France,Carretera,None,2178.0,3,15,32670.0,0.0,32670.0,21780.0,10890.0,2014-06-01,6,June,2014
3,Midmarket,Germany,Carretera,None,888.0,3,15,13320.0,0.0,13320.0,8880.0,4440.0,2014-06-01,6,June,2014
4,Midmarket,Mexico,Carretera,None,2470.0,3,15,37050.0,0.0,37050.0,24700.0,12350.0,2014-06-01,6,June,2014

## Loc

loc is primarily label based; when two arguments are used, you use column headers and row indexes to select the data you want. loc can also take an integer as a row or column number.

loc will return a KeyError if the requested items are not found.

In [16]:
print (df1.loc[0, "Country"]) 
print (df1.loc[1, "Country"])
print (df1.loc[0, "Units Sold"]) 
print (df1.loc[1, "Units Sold"])

Canada
Germany
1618.5
1321.0

## iloc

iloc is integer-based. You use column numbers and row numbers to get rows or columns at particular positions in the data frame.

iloc will return an IndexError if the requested indexer is out-of-bounds.

In [27]:
print(df1.iloc[0, 1])
print(df1.iloc[1, 1])
print(df1.iloc[0, 4])
print(df1.iloc[1, 4])

Canada
Germany
1618.5
1321.0

## ix

By default, ix looks for a label. If ix doesn't find a label, it will use an integer. This means you can select data by using either column numbers and row numbers or column headers and row names using ix.

In Pandas version 0.20.0 and later, ix is deprecated.

In [21]:
print(pd.__version__)

0.25.3

## Using loc and iloc for Slicing

You can also use loc and iloc to slice data frames and assign the values to a new data frame. 

### Creating a new dataframe with loc slicing

You can also slice data frames and assign the values to a new data frame using the column names. The code assigns the first three rows and all columns in between to the columns named Artist and Released. The result is a new data frame Z with the corresponding values.

In [23]:
new_df = df1.loc[0:5, "Country": "Units Sold"]
new_df.head()

   Country    Product Discount Band  Units Sold
0   Canada  Carretera          None      1618.5
1  Germany  Carretera          None      1321.0
2   France  Carretera          None      2178.0
3  Germany  Carretera          None       888.0
4   Mexico  Carretera          None      2470.0

### Creating a new dataframe with iloc slicing

In this example, we assign the first two rows and the first three columns to the variable Z. The result is a data frame comprised of the selected rows and columns.

In [30]:
new_df1 = df1.iloc[0: 10, 1: 5]
new_df1.head()

   Country    Product Discount Band  Units Sold
0   Canada  Carretera          None      1618.5
1  Germany  Carretera          None      1321.0
2   France  Carretera          None      2178.0
3  Germany  Carretera          None       888.0
4   Mexico  Carretera          None      2470.0

In [31]:
new_df1["Country"].unique()

array(['Canada', 'Germany', 'France', 'Mexico'], dtype=object)

In [32]:
new_df1["Country"] == "Canada"

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8    False
9    False
Name: Country, dtype: bool

In [35]:
new_df2 = new_df1[new_df1["Country"] == "Canada"]
new_df2.head()

  Country    Product Discount Band  Units Sold
0  Canada  Carretera          None      1618.5
7  Canada    Montana          None      2518.0

In [ ]:
df_m